Ran Plan for 2 projects:

1. dir: `deployment/service/fta-dev-svc-users` workspace: `default`
1. dir: `deployment/service/fta-stg-svc-users` workspace: `default`
---

### 1. dir: `deployment/service/fta-dev-svc-users` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d deployment/service/fta-dev-svc-users
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://fta-mstr-gce-atlantis:4141/lock?id=greyhats13%252Ffta_iac%252Fdeployment%252Fservice%252Ffta-dev-svc-users%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d deployment/service/fta-dev-svc-users
  ```

---
### 2. dir: `deployment/service/fta-stg-svc-users` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.cloud_deployment: Reading...
data.terraform_remote_state.cloud_deployment: Read complete after 0s
data.google_secret_manager_secret_version.iac: Reading...
data.google_kms_secret.secrets["docker_password"]: Reading...
data.google_kms_secret.secrets["docker_username"]: Reading...
data.google_project.current: Reading...
data.google_kms_secret.secrets["docker_password"]: Read complete after 0s [id=projects/fta-platform/locations/global/keyRings/fta-mstr-kms-main-keyring/cryptoKeys/fta-mstr-kms-main-cryptokey:CiQAVucnPifGB4MnNecmYsCnSxQRCzbIKukxHQhwRLyT+w1fCksSMgA4ny4NSUtvTYgl066O+xac6ufobge5fSoHJPxeB4DjyCmRZZW+nGio1opHT6dhTCh7]
data.google_kms_secret.secrets["docker_username"]: Read complete after 1s [id=projects/fta-platform/locations/global/keyRings/fta-mstr-kms-main-keyring/cryptoKeys/fta-mstr-kms-main-cryptokey:CiQAVucnPpO3+dUqGbG7KdfdueCDpSsA+meJNdAkPIGDxQRQNxASMwA4ny4N5APvPvsboBth6dp+lR9KpJr+KZoZbnGj/habtlweC1e5PQv6sAwpmyk9ojjgcw==]
data.google_secret_manager_secret_version.iac: Read complete after 1s [id=projects/781497044301/secrets/fta-mstr-gsm-iac/versions/1]
data.google_project.current: Read complete after 2s [id=projects/fta-platform]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # random_password.password will be created
+ resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 12
      + lower            = true
      + min_lower        = 3
      + min_numeric      = 3
      + min_special      = 0
      + min_upper        = 3
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.argocd_app.helm_release.helm will be created
+ resource "helm_release" "helm" {
      + atomic                     = false
      + chart                      = "argocd-apps"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = true
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "fta-stg-svc-users"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (sensitive value)
      + verify                     = false
      + version                    = "2.0.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.gsa.google_project_iam_member.sa_iam[0] will be created
+ resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "fta-platform"
      + role    = "roles/storage.objectViewer"
    }

  # module.gsa.google_project_iam_member.sa_iam[1] will be created
+ resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "fta-platform"
      + role    = "roles/cloudsql.client"
    }

  # module.gsa.google_service_account.gsa will be created
+ resource "google_service_account" "gsa" {
      + account_id   = "fta-stg-svc-users"
      + disabled     = false
      + display_name = "Service Account for fta-stg-svc-users service"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "fta-platform"
      + unique_id    = (known after apply)
    }

  # module.gsa.google_service_account_iam_binding.binding[0] will be created
+ resource "google_service_account_iam_binding" "binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:fta-platform.svc.id.goog[stg/fta-stg-svc-users]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.gsa.google_service_account_iam_binding.binding[1] will be created
+ resource "google_service_account_iam_binding" "binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:fta-platform.svc.id.goog[stg/fta-stg-svc-users]",
        ]
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # module.gsm.google_secret_manager_secret.secret will be created
+ resource "google_secret_manager_secret" "secret" {
      + annotations           = {
          + "code"    = "svc"
          + "env"     = "stg"
          + "feature" = "users"
          + "name"    = "fta-stg-svc-users"
          + "unit"    = "fta"
        }
      + create_time           = (known after apply)
      + effective_annotations = {
          + "code"    = "svc"
          + "env"     = "stg"
          + "feature" = "users"
          + "name"    = "fta-stg-svc-users"
          + "unit"    = "fta"
        }
      + effective_labels      = {
          + "code"                       = "svc"
          + "env"                        = "stg"
          + "feature"                    = "users"
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "fta-stg-svc-users"
          + "unit"                       = "fta"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "code"    = "svc"
          + "env"     = "stg"
          + "feature" = "users"
          + "name"    = "fta-stg-svc-users"
          + "unit"    = "fta"
        }
      + name                  = (known after apply)
      + project               = "fta-platform"
      + secret_id             = "fta-stg-svc-users"
      + terraform_labels      = {
          + "code"                       = "svc"
          + "env"                        = "stg"
          + "feature"                    = "users"
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "fta-stg-svc-users"
          + "unit"                       = "fta"
        }

      + replication {
          + user_managed {
              + replicas {
                  + location = "asia-southeast2"
                }
            }
        }
    }

  # module.gsm.google_secret_manager_secret_version.secret_version will be created
+ resource "google_secret_manager_secret_version" "secret_version" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + secret_data           = (sensitive value)
      + version               = (known after apply)
    }

  # module.sql.google_sql_database.database will be created
+ resource "google_sql_database" "database" {
      + charset         = "UTF8"
      + collation       = "en_US.UTF8"
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "fta-mstr-cloudsql-main"
      + name            = (known after apply)
      + project         = "fta-platform"
      + self_link       = (known after apply)
    }

  # module.sql.google_sql_user.user will be created
+ resource "google_sql_user" "user" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "fta-mstr-cloudsql-main"
      + name                    = (sensitive value)
      + password                = (sensitive value)
      + project                 = "fta-platform"
      + sql_server_user_details = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ service_account_email = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d deployment/service/fta-stg-svc-users
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://fta-mstr-gce-atlantis:4141/lock?id=greyhats13%252Ffta_iac%252Fdeployment%252Fservice%252Ffta-stg-svc-users%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d deployment/service/fta-stg-svc-users
  ```
Plan: 11 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 1 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```